StellanKenton/rep/module/esp32c5/esp32c5_ctrl.c
/************************************************************************************
* @file     : esp32c5_ctrl.c
* @brief    : ESP32-C5 internal control-plane implementation.
* @details  : Owns the BLE startup state machine, transaction submission,
*             URC state mapping, and retry policy.
* @author   : GitHub Copilot
* @date     : 2026-04-23
* @version  : V1.0.0
* @copyright: Copyright (c) 2050
***********************************************************************************/
#include "esp32c5_ctrl.h"

#include "esp32c5_port.h"

#include <string.h>

#include "../../sys/log/log.h"
#include "esp32c5_ble.h"
#include "esp32c5_mqtt.h"
#include "esp32c5_wifi.h"

#define ESP32C5_CTRL_LOG_TAG                 "esp32c5Ctl"
#define ESP32C5_DEFAULT_ADV_TYPE             0U
#define ESP32C5_DEFAULT_OWN_ADDR_TYPE        0U
#define ESP32C5_DEFAULT_CHANNEL_MAP          7U

static const char *const gEsp32c5CommonDonePatterns[] = {"OK"};
static const char *const gEsp32c5PromptDonePatterns[] = {"OK", "+HTTPCPOST:*", "+MQTTPUB:*"};
static const char *const gEsp32c5CommonErrorPatterns[] = {"ERROR", "FAIL"};
static const char *const gEsp32c5DefaultUrcPrefixes[] = {
    "+BLECONN",
    "+BLEDISCONN",
    "+BLECFGMTU",
    "+WRITE",
    "+READ",
    "+NOTIFY",
    "+INDICATE",
    "ready",
};

static const stFlowParserSpec gEsp32c5CommonSpec = {
    .responseDonePatterns = gEsp32c5CommonDonePatterns,
    .responseDonePatternCnt = 1U,
    .finalDonePatterns = NULL,
    .finalDonePatternCnt = 0U,
    .errorPatterns = gEsp32c5CommonErrorPatterns,
    .errorPatternCnt = 2U,
    .totalToutMs = ESP32C5_DEFAULT_CMD_TIMEOUT_MS,
    .responseToutMs = ESP32C5_DEFAULT_CMD_TIMEOUT_MS,
    .promptToutMs = 0U,
    .finalToutMs = 0U,
    .needPrompt = false,
};

static const stFlowParserSpec gEsp32c5PromptSpec = {
    .responseDonePatterns = NULL,
    .responseDonePatternCnt = 0U,
    .finalDonePatterns = gEsp32c5PromptDonePatterns,
    .finalDonePatternCnt = 3U,
    .errorPatterns = gEsp32c5CommonErrorPatterns,
    .errorPatternCnt = 2U,
    .totalToutMs = ESP32C5_DEFAULT_FINAL_TIMEOUT_MS,
    .responseToutMs = 0U,
    .promptToutMs = ESP32C5_DEFAULT_PROMPT_TIMEOUT_MS,
    .finalToutMs = ESP32C5_DEFAULT_FINAL_TIMEOUT_MS,
    .needPrompt = true,
};

static eEsp32c5Status esp32c5SubmitCtrlText(stEsp32c5Device *device, const char *cmdText);
static eEsp32c5Status esp32c5SubmitCtrlPrompt(stEsp32c5Device *device, const char *cmdText, const uint8_t *payloadBuf, uint16_t payloadLen);
static eEsp32c5Status esp32c5BuildCtrlU16(stEsp32c5Device *device, const char *prefix, uint16_t value);
static eEsp32c5Status esp32c5BuildCtrlQuotedText(stEsp32c5Device *device, const char *prefix, const char *text);
static eEsp32c5Status esp32c5BuildCtrlAdvParam(stEsp32c5Device *device);
static eEsp32c5Status esp32c5BuildCtrlAdvData(stEsp32c5Device *device);
static uint16_t esp32c5GetBleNotifyPayloadLimit(const stEsp32c5Device *device);
static eEsp32c5Status esp32c5AppendChar(char *buffer, uint16_t bufferSize, uint16_t *length, char value);
static eEsp32c5Status esp32c5AppendText(char *buffer, uint16_t bufferSize, uint16_t *length, const char *text);
static eEsp32c5Status esp32c5AppendU16(char *buffer, uint16_t bufferSize, uint16_t *length, uint16_t value);
static eEsp32c5Status esp32c5AppendQuotedText(char *buffer, uint16_t bufferSize, uint16_t *length, const char *text);
static eEsp32c5Status esp32c5HandleCtrlDone(stEsp32c5Device *device, eEsp32c5MapType deviceId, uint32_t nowTickMs);
static eEsp32c5Status esp32c5ProcessCtrlStage(stEsp32c5Device *device, eEsp32c5MapType deviceId, uint32_t nowTickMs);
static bool esp32c5MatchPrefix(const uint8_t *lineBuf, uint16_t lineLen, const char *prefix);
static const char *esp32c5CtrlGetStageName(eEsp32c5CtrlStage stage);
static const char *esp32c5CtrlGetRoleName(eEsp32c5Role role);
static void esp32c5CtrlSetStage(stEsp32c5Device *device, eEsp32c5CtrlStage stage);

bool esp32c5IsValidRole(eEsp32c5Role role)
{
    return (role > ESP32C5_ROLE_NONE) && (role < ESP32C5_ROLE_MAX);
}

void esp32c5LoadDefBleCfg(stEsp32c5BleCfg *cfg)
{
    esp32c5BleLoadDefCfg(cfg);
}

bool esp32c5IsValidText(const char *text, uint16_t maxLength, bool allowEmpty)
{
    return esp32c5BleIsValidText(text, maxLength, allowEmpty);
}

void esp32c5ResetState(stEsp32c5Device *device)
{
    if (device == NULL) {
        return;
    }

    (void)memset(&device->state, 0, sizeof(device->state));
    device->state.runState = device->info.isInit ? ESP32C5_RUN_IDLE : ESP32C5_RUN_UNINIT;
    device->state.lastError = ESP32C5_STATUS_OK;
    device->ctrlPlane.nextActionTick = 0U;
    device->ctrlPlane.readyDeadlineTick = 0U;
    device->ctrlPlane.stage = ESP32C5_CTRL_STAGE_IDLE;
    device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
    device->ctrlPlane.isTxnDone = false;
    device->ctrlPlane.txnStatus = ESP32C5_STATUS_OK;
    device->ctrlPlane.userTextLineHandler = NULL;
    device->ctrlPlane.userTextUserData = NULL;
    device->ctrlPlane.cmdBuf[0] = '\0';
    esp32c5DataReset(&device->dataPlane);
}

void esp32c5SyncInfo(stEsp32c5Device *device)
{
    if (device == NULL) {
        return;
    }

    device->info.stage = flowparserStreamGetStage(&device->stream);
    device->info.isBusy = flowparserStreamIsBusy(&device->stream);
}

void esp32c5SyncState(stEsp32c5Device *device)
{
    if (device == NULL) {
        return;
    }

    esp32c5SyncInfo(device);
    device->state.isBusy = device->info.isBusy ||
                           ((device->state.role != ESP32C5_ROLE_NONE) &&
                            (device->ctrlPlane.stage != ESP32C5_CTRL_STAGE_IDLE) &&
                            (device->ctrlPlane.stage != ESP32C5_CTRL_STAGE_RUNNING));
}

const stEsp32c5TransportInterface *esp32c5GetTransport(const stEsp32c5Device *device)
{
    const stEsp32c5Ops *lOps;

    if (device == NULL) {
        return NULL;
    }

    lOps = esp32c5PortGetOps();
    if ((lOps == NULL) || (lOps->getTransportInterface == NULL)) {
        return NULL;
    }

    return lOps->getTransportInterface(&device->cfg);
}

const stEsp32c5ControlInterface *esp32c5GetControl(eEsp32c5MapType device)
{
    const stEsp32c5Ops *lOps = esp32c5PortGetOps();

    if ((lOps == NULL) || (lOps->getControlInterface == NULL)) {
        return NULL;
    }

    return lOps->getControlInterface(device);
}

