StellanKenton/rep/module/esp32c5/esp32c5_ctrl.c
eEsp32c5Status esp32c5MapDrvStatus(eDrvStatus status)
{
    switch (status) {
        case DRV_STATUS_OK:
            return ESP32C5_STATUS_OK;
        case DRV_STATUS_INVALID_PARAM:
            return ESP32C5_STATUS_INVALID_PARAM;
        case DRV_STATUS_NOT_READY:
            return ESP32C5_STATUS_NOT_READY;
        case DRV_STATUS_BUSY:
            return ESP32C5_STATUS_BUSY;
        case DRV_STATUS_TIMEOUT:
            return ESP32C5_STATUS_TIMEOUT;
        default:
            return ESP32C5_STATUS_ERROR;
    }
}

eEsp32c5Status esp32c5MapStreamStatus(eFlowParserStrmSta status)
{
    switch (status) {
        case FLOWPARSER_STREAM_OK:
        case FLOWPARSER_STREAM_EMPTY:
            return ESP32C5_STATUS_OK;
        case FLOWPARSER_STREAM_BUSY:
            return ESP32C5_STATUS_BUSY;
        case FLOWPARSER_STREAM_INVALID_PARAM:
            return ESP32C5_STATUS_INVALID_PARAM;
        case FLOWPARSER_STREAM_NOT_INIT:
            return ESP32C5_STATUS_NOT_READY;
        case FLOWPARSER_STREAM_OVERFLOW:
            return ESP32C5_STATUS_OVERFLOW;
        case FLOWPARSER_STREAM_TIMEOUT:
            return ESP32C5_STATUS_TIMEOUT;
        case FLOWPARSER_STREAM_PORT_FAIL:
        case FLOWPARSER_STREAM_ERROR:
        default:
            return ESP32C5_STATUS_STREAM_FAIL;
    }
}

eEsp32c5Status esp32c5MapResult(eFlowParserResult result)
{
    switch (result) {
        case FLOWPARSER_RESULT_OK:
            return ESP32C5_STATUS_OK;
        case FLOWPARSER_RESULT_TIMEOUT:
            return ESP32C5_STATUS_TIMEOUT;
        case FLOWPARSER_RESULT_OVERFLOW:
            return ESP32C5_STATUS_OVERFLOW;
        case FLOWPARSER_RESULT_SEND_FAIL:
            return ESP32C5_STATUS_STREAM_FAIL;
        case FLOWPARSER_RESULT_ERROR:
        default:
            return ESP32C5_STATUS_ERROR;
    }
}

eEsp32c5Status esp32c5CtrlStart(stEsp32c5Device *device, eEsp32c5Role role)
{
    if ((device == NULL) || !esp32c5IsValidRole(role)) {
        return ESP32C5_STATUS_INVALID_PARAM;
    }

    esp32c5DataReset(&device->dataPlane);
    device->info.hasLastResult = false;
    device->info.lastResult = FLOWPARSER_RESULT_OK;
    device->info.rxBytes = 0U;
    device->info.urcCount = 0U;
    device->state.role = role;
    device->state.runState = ESP32C5_RUN_BOOTING;
    device->state.isReady = false;
    device->state.isBusy = true;
    device->state.isBleAdvertising = false;
    device->state.isBleConnected = false;
    device->state.isBleMtuConfigured = false;
    device->state.isReadyUrcSeen = false;
    device->state.hasMacAddress = false;
    device->state.connIndex = 0U;
    device->state.bleMtu = 23U;
    device->state.lastError = ESP32C5_STATUS_OK;
    device->state.macAddress[0] = '\0';
    esp32c5CtrlSetStage(device, ESP32C5_CTRL_STAGE_ASSERT_RESET);
    device->ctrlPlane.nextActionTick = 0U;
    device->ctrlPlane.readyDeadlineTick = 0U;
    device->ctrlPlane.isTxnDone = false;
    device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
    device->ctrlPlane.txnStatus = ESP32C5_STATUS_OK;
    device->ctrlPlane.userTextLineHandler = NULL;
    device->ctrlPlane.userTextUserData = NULL;
    device->ctrlPlane.cmdBuf[0] = '\0';
    LOG_I(ESP32C5_CTRL_LOG_TAG, "start role=%s", esp32c5CtrlGetRoleName(role));
    return ESP32C5_STATUS_OK;
}

eEsp32c5Status esp32c5CtrlDisconnectBle(stEsp32c5Device *device)
{
    eEsp32c5Status status;

    if (device == NULL) {
        return ESP32C5_STATUS_INVALID_PARAM;
    }

    esp32c5SyncState(device);
    if ((device->state.role != ESP32C5_ROLE_BLE_PERIPHERAL) || !device->state.isReady) {
        return ESP32C5_STATUS_NOT_READY;
    }

    if (device->ctrlPlane.stage != ESP32C5_CTRL_STAGE_RUNNING) {
        return ESP32C5_STATUS_BUSY;
    }

    if (device->info.isBusy) {
        return ESP32C5_STATUS_BUSY;
    }

    device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_BLE_DISCONNECT;
    device->ctrlPlane.cmdBuf[0] = '\0';
    status = esp32c5AppendText(device->ctrlPlane.cmdBuf, sizeof(device->ctrlPlane.cmdBuf), &(uint16_t){0U}, "");
    (void)status;

    device->ctrlPlane.cmdBuf[0] = '\0';
    {
        uint16_t length = 0U;
        status = esp32c5AppendText(device->ctrlPlane.cmdBuf, sizeof(device->ctrlPlane.cmdBuf), &length, "AT+BLEDISCONN=");
        if (status == ESP32C5_STATUS_OK) {
            status = esp32c5AppendU16(device->ctrlPlane.cmdBuf, sizeof(device->ctrlPlane.cmdBuf), &length, device->state.connIndex);
        }
        if (status == ESP32C5_STATUS_OK) {
            status = esp32c5AppendText(device->ctrlPlane.cmdBuf, sizeof(device->ctrlPlane.cmdBuf), &length, "\r\n");
        }
    }
    if (status != ESP32C5_STATUS_OK) {
        device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
        return status;
    }

    status = esp32c5SubmitCtrlText(device, device->ctrlPlane.cmdBuf);
    if (status != ESP32C5_STATUS_OK) {
        device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
        LOG_W(ESP32C5_CTRL_LOG_TAG, "submit ble disconnect failed status=%d", (int)status);
    }

    return status;
}

eEsp32c5Status esp32c5CtrlSubmitTextCommand(stEsp32c5Device *device, const char *cmdText)
{
    return esp32c5CtrlSubmitTextCommandEx(device, cmdText, NULL, NULL);
}

eEsp32c5Status esp32c5CtrlSubmitTextCommandEx(stEsp32c5Device *device, const char *cmdText, esp32c5LineFunc lineHandler, void *userData)
{
    if ((device == NULL) || (cmdText == NULL)) {
        return ESP32C5_STATUS_INVALID_PARAM;
    }

    esp32c5SyncState(device);
    if ((device->ctrlPlane.stage != ESP32C5_CTRL_STAGE_RUNNING) || device->info.isBusy) {
        return ESP32C5_STATUS_BUSY;
    }

    device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_USER_TEXT;
    device->ctrlPlane.userTextLineHandler = lineHandler;
    device->ctrlPlane.userTextUserData = userData;
    if (esp32c5SubmitCtrlText(device, cmdText) != ESP32C5_STATUS_OK) {
        device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
        device->ctrlPlane.userTextLineHandler = NULL;
        device->ctrlPlane.userTextUserData = NULL;
        return device->state.lastError = ESP32C5_STATUS_BUSY;
    }

