StellanKenton/rep/module/esp32c5/esp32c5_ctrl.c
    return ESP32C5_STATUS_OK;
}

eEsp32c5Status esp32c5CtrlSubmitPromptCommandEx(stEsp32c5Device *device, const char *cmdText, const uint8_t *payloadBuf, uint16_t payloadLen, esp32c5LineFunc lineHandler, void *userData)
{
    if ((device == NULL) || (cmdText == NULL) || (payloadBuf == NULL) || (payloadLen == 0U)) {
        return ESP32C5_STATUS_INVALID_PARAM;
    }

    esp32c5SyncState(device);
    if ((device->ctrlPlane.stage != ESP32C5_CTRL_STAGE_RUNNING) || device->info.isBusy) {
        return ESP32C5_STATUS_BUSY;
    }

    device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_USER_TEXT;
    device->ctrlPlane.userTextLineHandler = lineHandler;
    device->ctrlPlane.userTextUserData = userData;
    if (esp32c5SubmitCtrlPrompt(device, cmdText, payloadBuf, payloadLen) != ESP32C5_STATUS_OK) {
        device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
        device->ctrlPlane.userTextLineHandler = NULL;
        device->ctrlPlane.userTextUserData = NULL;
        return device->state.lastError = ESP32C5_STATUS_BUSY;
    }

    return ESP32C5_STATUS_OK;
}

void esp32c5CtrlStop(stEsp32c5Device *device)
{
    esp32c5ResetState(device);
}

eEsp32c5Status esp32c5CtrlProcess(stEsp32c5Device *device, eEsp32c5MapType deviceId, uint32_t nowTickMs)
{
    eEsp32c5Status status;

    if (device == NULL) {
        return ESP32C5_STATUS_INVALID_PARAM;
    }

    esp32c5SyncState(device);
    if (device->state.role == ESP32C5_ROLE_NONE) {
        return ESP32C5_STATUS_OK;
    }

    if (device->ctrlPlane.isTxnDone && !device->info.isBusy) {
        status = esp32c5HandleCtrlDone(device, deviceId, nowTickMs);
        if (status != ESP32C5_STATUS_OK) {
            return status;
        }
    }

    if (device->info.isBusy) {
        return ESP32C5_STATUS_OK;
    }

    return esp32c5ProcessCtrlStage(device, deviceId, nowTickMs);
}

void esp32c5CtrlScheduleRetry(stEsp32c5Device *device, eEsp32c5MapType deviceId, uint32_t nowTickMs, eEsp32c5Status status)
{
    const stEsp32c5ControlInterface *control;
    eEsp32c5Role role;

    if (device == NULL) {
        return;
    }

    control = esp32c5GetControl(deviceId);
    if ((control != NULL) && (control->setResetLevel != NULL)) {
        control->setResetLevel(device->cfg.resetPin, true);
    }

    role = device->state.role;
    flowparserStreamReset(&device->stream);
    esp32c5DataClearPendingTx(&device->dataPlane);
    device->state.isReady = false;
    device->state.isBusy = true;
    device->state.isBleAdvertising = false;
    device->state.isBleConnected = false;
    device->state.isBleMtuConfigured = false;
    device->state.isReadyUrcSeen = false;
    device->state.hasMacAddress = false;
    device->state.connIndex = 0U;
    device->state.bleMtu = 23U;
    device->state.lastError = status;
    device->state.runState = ESP32C5_RUN_ERROR;
    device->state.macAddress[0] = '\0';
    device->state.role = role;
    esp32c5CtrlSetStage(device, ESP32C5_CTRL_STAGE_ASSERT_RESET);
    device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
    device->ctrlPlane.userTextLineHandler = NULL;
    device->ctrlPlane.userTextUserData = NULL;
    device->ctrlPlane.nextActionTick = nowTickMs + device->cfg.retryIntervalMs;
    device->ctrlPlane.readyDeadlineTick = 0U;
    device->ctrlPlane.isTxnDone = false;
    device->ctrlPlane.txnStatus = ESP32C5_STATUS_OK;
    device->ctrlPlane.cmdBuf[0] = '\0';
    LOG_W(ESP32C5_CTRL_LOG_TAG,
          "schedule retry role=%s status=%d after=%lu stage=%s",
          esp32c5CtrlGetRoleName(role),
          (int)status,
          (unsigned long)device->cfg.retryIntervalMs,
          esp32c5CtrlGetStageName(device->ctrlPlane.stage));
}

bool esp32c5CtrlIsUrc(const stEsp32c5Device *device, const uint8_t *lineBuf, uint16_t lineLen)
{
    uint32_t index;

    if ((device == NULL) || (lineBuf == NULL) || (lineLen == 0U)) {
        return false;
    }

    if ((device->urcCb.pfMatcher != NULL) &&
        device->urcCb.pfMatcher(device->urcCb.matcherUserData, lineBuf, lineLen)) {
        return true;
    }

    if (esp32c5BleIsUrc(lineBuf, lineLen) ||
        esp32c5WifiIsUrc(lineBuf, lineLen) ||
        esp32c5MqttIsUrc(lineBuf, lineLen)) {
        return true;
    }

    for (index = 0U; index < (uint32_t)(sizeof(gEsp32c5DefaultUrcPrefixes) / sizeof(gEsp32c5DefaultUrcPrefixes[0])); index++) {
        if (esp32c5MatchPrefix(lineBuf, lineLen, gEsp32c5DefaultUrcPrefixes[index])) {
            return true;
        }
    }

    return false;
}

void esp32c5CtrlHandleUrc(stEsp32c5Device *device, const uint8_t *lineBuf, uint16_t lineLen)
{
    uint8_t connIndex;
    uint16_t mtu;
    bool keepNegotiatedMtu;

    if ((device == NULL) || (lineBuf == NULL) || (lineLen == 0U)) {
        return;
    }

    device->info.urcCount++;
    if ((lineLen == 5U) && (memcmp(lineBuf, "ready", 5U) == 0)) {
        device->state.isReadyUrcSeen = true;
        LOG_I(ESP32C5_CTRL_LOG_TAG, "urc ready");
        return;
    }

    if (esp32c5MatchPrefix(lineBuf, lineLen, "+BLECONN")) {
        connIndex = 0U;
        (void)esp32c5BleTryParseConnIndex(lineBuf, lineLen, &connIndex);
        keepNegotiatedMtu = device->state.isBleMtuConfigured &&
                            (device->state.connIndex == connIndex) &&
                            (device->state.bleMtu > 23U);
        device->state.connIndex = connIndex;
        device->state.isBleAdvertising = false;
        device->state.isBleConnected = true;
        if (!keepNegotiatedMtu) {
            device->state.isBleMtuConfigured = false;
            device->state.bleMtu = 23U;
        }
        LOG_I(ESP32C5_CTRL_LOG_TAG, "urc ble connected idx=%u", (unsigned int)connIndex);
        return;
    }

    if (esp32c5MatchPrefix(lineBuf, lineLen, "+BLECFGMTU")) {
        connIndex = 0U;
        mtu = 0U;
        if (esp32c5BleTryParseMtu(lineBuf, lineLen, &connIndex, &mtu)) {
            device->state.connIndex = connIndex;
            device->state.bleMtu = mtu;
            device->state.isBleMtuConfigured = mtu > 23U;
            LOG_I(ESP32C5_CTRL_LOG_TAG,
                  "urc ble mtu idx=%u mtu=%u",
                  (unsigned int)connIndex,
                  (unsigned int)mtu);
        }
        return;
    }

    if (esp32c5MatchPrefix(lineBuf, lineLen, "+BLEDISCONN")) {
        device->state.isBleAdvertising = false;
        device->state.isBleConnected = false;
        device->state.isBleMtuConfigured = false;
        device->state.connIndex = 0U;
        device->state.bleMtu = 23U;
        LOG_I(ESP32C5_CTRL_LOG_TAG, "urc ble disconnected");
    }
}

void esp32c5CtrlHandleTxnLine(stEsp32c5Device *device, const uint8_t *lineBuf, uint16_t lineLen)
{
    if ((device == NULL) || (lineBuf == NULL) || (lineLen == 0U)) {
        return;
    }

    if ((device->ctrlPlane.stage == ESP32C5_CTRL_STAGE_QUERY_MAC) &&
        esp32c5BleTryParseMacAddress(lineBuf, lineLen, device->state.macAddress, (uint16_t)sizeof(device->state.macAddress))) {
        device->state.hasMacAddress = true;
    }

    if ((device->ctrlPlane.txnKind == ESP32C5_CTRL_TXN_USER_TEXT) &&
        (device->ctrlPlane.userTextLineHandler != NULL)) {
        device->ctrlPlane.userTextLineHandler(device->ctrlPlane.userTextUserData, lineBuf, lineLen);
    }
}

