StellanKenton/rep/module/esp32c5/esp32c5_ctrl.c
void esp32c5CtrlHandleTxnDone(stEsp32c5Device *device, eFlowParserResult result)
{
    if (device == NULL) {
        return;
    }

    device->info.hasLastResult = true;
    device->info.lastResult = result;
    device->ctrlPlane.isTxnDone = true;
    device->ctrlPlane.txnStatus = esp32c5MapResult(result);
    if (device->ctrlPlane.txnStatus != ESP32C5_STATUS_OK) {
        LOG_W(ESP32C5_CTRL_LOG_TAG,
              "txn done failed stage=%s result=%d status=%d",
              esp32c5CtrlGetStageName(device->ctrlPlane.stage),
              (int)result,
              (int)device->ctrlPlane.txnStatus);
    }
}

void esp32c5TxnLineThunk(void *userData, const uint8_t *lineBuf, uint16_t lineLen)
{
    esp32c5CtrlHandleTxnLine((stEsp32c5Device *)userData, lineBuf, lineLen);
}

void esp32c5TxnDoneThunk(void *userData, eFlowParserResult result)
{
    esp32c5CtrlHandleTxnDone((stEsp32c5Device *)userData, result);
}

static eEsp32c5Status esp32c5SubmitCtrlText(stEsp32c5Device *device, const char *cmdText)
{
    stFlowParserReq req;
    eFlowParserStrmSta streamStatus;

    if ((device == NULL) || (cmdText == NULL)) {
        return ESP32C5_STATUS_INVALID_PARAM;
    }

    req.spec = &gEsp32c5CommonSpec;
    req.cmdBuf = (const uint8_t *)cmdText;
    req.cmdLen = (uint16_t)strlen(cmdText);
    req.payloadBuf = NULL;
    req.payloadLen = 0U;
    req.lineHandler = esp32c5TxnLineThunk;
    req.doneHandler = esp32c5TxnDoneThunk;
    req.userData = device;

    streamStatus = flowparserStreamSubmit(&device->stream, &req);
    if (streamStatus != FLOWPARSER_STREAM_OK) {
        LOG_W(ESP32C5_CTRL_LOG_TAG,
              "submit cmd failed stage=%s status=%d cmd=%s",
              esp32c5CtrlGetStageName(device->ctrlPlane.stage),
              (int)streamStatus,
              cmdText);
    }

    return esp32c5MapStreamStatus(streamStatus);
}

static eEsp32c5Status esp32c5SubmitCtrlPrompt(stEsp32c5Device *device, const char *cmdText, const uint8_t *payloadBuf, uint16_t payloadLen)
{
    stFlowParserReq req;
    eFlowParserStrmSta streamStatus;

    if ((device == NULL) || (cmdText == NULL) || (payloadBuf == NULL) || (payloadLen == 0U)) {
        return ESP32C5_STATUS_INVALID_PARAM;
    }

    req.spec = &gEsp32c5PromptSpec;
    req.cmdBuf = (const uint8_t *)cmdText;
    req.cmdLen = (uint16_t)strlen(cmdText);
    req.payloadBuf = payloadBuf;
    req.payloadLen = payloadLen;
    req.lineHandler = esp32c5TxnLineThunk;
    req.doneHandler = esp32c5TxnDoneThunk;
    req.userData = device;

    streamStatus = flowparserStreamSubmit(&device->stream, &req);
    if (streamStatus != FLOWPARSER_STREAM_OK) {
        LOG_W(ESP32C5_CTRL_LOG_TAG,
              "submit prompt cmd failed stage=%s status=%d cmd=%s",
              esp32c5CtrlGetStageName(device->ctrlPlane.stage),
              (int)streamStatus,
              cmdText);
    }

    return esp32c5MapStreamStatus(streamStatus);
}

static eEsp32c5Status esp32c5BuildCtrlU16(stEsp32c5Device *device, const char *prefix, uint16_t value)
{
    uint16_t length;
    eEsp32c5Status status;

    if ((device == NULL) || (prefix == NULL)) {
        return ESP32C5_STATUS_INVALID_PARAM;
    }

    length = 0U;
    device->ctrlPlane.cmdBuf[0] = '\0';
    status = esp32c5AppendText(device->ctrlPlane.cmdBuf, sizeof(device->ctrlPlane.cmdBuf), &length, prefix);
    if (status == ESP32C5_STATUS_OK) {
        status = esp32c5AppendU16(device->ctrlPlane.cmdBuf, sizeof(device->ctrlPlane.cmdBuf), &length, value);
    }
    if (status == ESP32C5_STATUS_OK) {
        status = esp32c5AppendText(device->ctrlPlane.cmdBuf, sizeof(device->ctrlPlane.cmdBuf), &length, "\r\n");
    }

    return (status == ESP32C5_STATUS_OK) ? esp32c5SubmitCtrlText(device, device->ctrlPlane.cmdBuf) : status;
}

static eEsp32c5Status esp32c5BuildCtrlQuotedText(stEsp32c5Device *device, const char *prefix, const char *text)
{
    uint16_t length;
    eEsp32c5Status status;

    if ((device == NULL) || (prefix == NULL) || (text == NULL)) {
        return ESP32C5_STATUS_INVALID_PARAM;
    }

    length = 0U;
    device->ctrlPlane.cmdBuf[0] = '\0';
    status = esp32c5AppendText(device->ctrlPlane.cmdBuf, sizeof(device->ctrlPlane.cmdBuf), &length, prefix);
    if (status == ESP32C5_STATUS_OK) {
        status = esp32c5AppendQuotedText(device->ctrlPlane.cmdBuf, sizeof(device->ctrlPlane.cmdBuf), &length, text);
    }
    if (status == ESP32C5_STATUS_OK) {
        status = esp32c5AppendText(device->ctrlPlane.cmdBuf, sizeof(device->ctrlPlane.cmdBuf), &length, "\r\n");
    }

    return (status == ESP32C5_STATUS_OK) ? esp32c5SubmitCtrlText(device, device->ctrlPlane.cmdBuf) : status;
}

static eEsp32c5Status esp32c5BuildCtrlAdvParam(stEsp32c5Device *device)
{
    eEsp32c5Status status;

    if (device == NULL) {
        return ESP32C5_STATUS_INVALID_PARAM;
    }

    status = esp32c5BleBuildAdvParamCommand(&device->bleCfg,
                                            device->ctrlPlane.cmdBuf,
                                            (uint16_t)sizeof(device->ctrlPlane.cmdBuf));
    return (status == ESP32C5_STATUS_OK) ? esp32c5SubmitCtrlText(device, device->ctrlPlane.cmdBuf) : status;
}

static eEsp32c5Status esp32c5BuildCtrlAdvData(stEsp32c5Device *device)
{
    eEsp32c5Status status;

    if (device == NULL) {
        return ESP32C5_STATUS_INVALID_PARAM;
    }

    status = esp32c5BleBuildAdvDataCommand(&device->bleCfg,
                                           device->ctrlPlane.cmdBuf,
                                           (uint16_t)sizeof(device->ctrlPlane.cmdBuf));
    return (status == ESP32C5_STATUS_OK) ? esp32c5SubmitCtrlText(device, device->ctrlPlane.cmdBuf) : status;
}

static uint16_t esp32c5GetBleNotifyPayloadLimit(const stEsp32c5Device *device)
{
    if (device == NULL) {
        return 20U;
    }
    return esp32c5BleGetNotifyPayloadLimit(&device->state);
}

static eEsp32c5Status esp32c5AppendChar(char *buffer, uint16_t bufferSize, uint16_t *length, char value)
{
    if ((buffer == NULL) || (length == NULL) || (bufferSize == 0U) || (*length >= (uint16_t)(bufferSize - 1U))) {
        return ESP32C5_STATUS_OVERFLOW;
    }

    buffer[*length] = value;
    *length = (uint16_t)(*length + 1U);
    buffer[*length] = '\0';
    return ESP32C5_STATUS_OK;
}

static eEsp32c5Status esp32c5AppendText(char *buffer, uint16_t bufferSize, uint16_t *length, const char *text)
{
    if ((buffer == NULL) || (length == NULL) || (text == NULL)) {
        return ESP32C5_STATUS_INVALID_PARAM;
    }

    while (*text != '\0') {
        if (esp32c5AppendChar(buffer, bufferSize, length, *text++) != ESP32C5_STATUS_OK) {
            return ESP32C5_STATUS_OVERFLOW;
        }
    }

