StellanKenton/rep/module/esp32c5/esp32c5_ctrl.c
    return ESP32C5_STATUS_OK;
}

static eEsp32c5Status esp32c5AppendU16(char *buffer, uint16_t bufferSize, uint16_t *length, uint16_t value)
{
    char digits[5];
    uint16_t index;
    uint16_t outIndex;

    if ((buffer == NULL) || (length == NULL)) {
        return ESP32C5_STATUS_INVALID_PARAM;
    }

    index = 0U;
    do {
        digits[index++] = (char)('0' + (value % 10U));
        value = (uint16_t)(value / 10U);
    } while ((value > 0U) && (index < (uint16_t)sizeof(digits)));

    while (index > 0U) {
        outIndex = (uint16_t)(index - 1U);
        if (esp32c5AppendChar(buffer, bufferSize, length, digits[outIndex]) != ESP32C5_STATUS_OK) {
            return ESP32C5_STATUS_OVERFLOW;
        }
        index--;
    }

    return ESP32C5_STATUS_OK;
}

static eEsp32c5Status esp32c5AppendQuotedText(char *buffer, uint16_t bufferSize, uint16_t *length, const char *text)
{
    eEsp32c5Status status;

    status = esp32c5AppendChar(buffer, bufferSize, length, '"');
    if (status == ESP32C5_STATUS_OK) {
        status = esp32c5AppendText(buffer, bufferSize, length, text);
    }
    if (status == ESP32C5_STATUS_OK) {
        status = esp32c5AppendChar(buffer, bufferSize, length, '"');
    }

    return status;
}

static eEsp32c5Status esp32c5HandleCtrlDone(stEsp32c5Device *device, eEsp32c5MapType deviceId, uint32_t nowTickMs)
{
    eEsp32c5Status status;

    if (device == NULL) {
        return ESP32C5_STATUS_INVALID_PARAM;
    }

    status = device->ctrlPlane.txnStatus;
    device->ctrlPlane.isTxnDone = false;
    device->ctrlPlane.txnStatus = ESP32C5_STATUS_OK;

    if (status != ESP32C5_STATUS_OK) {
        if (device->ctrlPlane.stage == ESP32C5_CTRL_STAGE_WAIT_READY) {
            if (nowTickMs >= device->ctrlPlane.readyDeadlineTick) {
                esp32c5CtrlScheduleRetry(device, deviceId, nowTickMs, status);
                return status;
            }

            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
            device->ctrlPlane.nextActionTick = nowTickMs + device->cfg.readyProbeMs;
            return ESP32C5_STATUS_OK;
        }

        if (device->ctrlPlane.stage == ESP32C5_CTRL_STAGE_QUERY_MAC) {
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
            esp32c5CtrlSetStage(device, ESP32C5_CTRL_STAGE_RUNNING);
            device->state.runState = ESP32C5_RUN_READY;
            device->state.isReady = true;
            LOG_W(ESP32C5_CTRL_LOG_TAG, "mac query failed, continue without cached mac");
            return ESP32C5_STATUS_OK;
        }

        if (device->ctrlPlane.stage == ESP32C5_CTRL_STAGE_RUNNING) {
            device->state.lastError = status;
            if (device->ctrlPlane.txnKind == ESP32C5_CTRL_TXN_DATA_TX) {
                LOG_W(ESP32C5_CTRL_LOG_TAG,
                      "notify len=%u failed, keep mtu=%u",
                      (unsigned int)device->dataPlane.txPendingLen,
                      (unsigned int)device->state.bleMtu);
                esp32c5DataConfirmPendingTx(&device->dataPlane);
            } else if (device->ctrlPlane.txnKind == ESP32C5_CTRL_TXN_BLE_CFG_MTU) {
                LOG_W(ESP32C5_CTRL_LOG_TAG,
                      "mtu query failed, keep negotiated mtu=%u configured=%u",
                      (unsigned int)device->state.bleMtu,
                      (unsigned int)device->state.isBleMtuConfigured);
            }
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
            return ESP32C5_STATUS_OK;
        }

        esp32c5CtrlScheduleRetry(device, deviceId, nowTickMs, status);
        return status;
    }

    switch (device->ctrlPlane.stage) {
        case ESP32C5_CTRL_STAGE_WAIT_READY:
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
            device->state.runState = ESP32C5_RUN_CONFIGURING;
            esp32c5CtrlSetStage(device, ESP32C5_CTRL_STAGE_DISABLE_ECHO);
            break;
        case ESP32C5_CTRL_STAGE_DISABLE_ECHO:
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
            esp32c5CtrlSetStage(device, ESP32C5_CTRL_STAGE_BLE_INIT);
            break;
        case ESP32C5_CTRL_STAGE_BLE_INIT:
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
            esp32c5CtrlSetStage(device, ESP32C5_CTRL_STAGE_BLE_SET_NAME);
            break;
        case ESP32C5_CTRL_STAGE_BLE_SET_NAME:
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
            esp32c5CtrlSetStage(device, ESP32C5_CTRL_STAGE_BLE_SET_ADV_PARAM);
            break;
        case ESP32C5_CTRL_STAGE_BLE_SET_ADV_PARAM:
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
            esp32c5CtrlSetStage(device, ESP32C5_CTRL_STAGE_BLE_SET_ADV_DATA);
            break;
        case ESP32C5_CTRL_STAGE_BLE_SET_ADV_DATA:
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
            esp32c5CtrlSetStage(device, device->bleCfg.autoStartAdvertising ? ESP32C5_CTRL_STAGE_BLE_ADV_START : ESP32C5_CTRL_STAGE_QUERY_MAC);
            break;
        case ESP32C5_CTRL_STAGE_BLE_ADV_START:
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
            device->state.isBleAdvertising = true;
            esp32c5CtrlSetStage(device, ESP32C5_CTRL_STAGE_QUERY_MAC);
            break;
        case ESP32C5_CTRL_STAGE_QUERY_MAC:
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
            esp32c5CtrlSetStage(device, ESP32C5_CTRL_STAGE_RUNNING);
            device->state.runState = ESP32C5_RUN_READY;
            device->state.isReady = true;
            LOG_I(ESP32C5_CTRL_LOG_TAG,
                  "module ready mac=%s",
                  device->state.hasMacAddress ? device->state.macAddress : "<unknown>");
            break;
        case ESP32C5_CTRL_STAGE_RUNNING:
            if (device->ctrlPlane.txnKind == ESP32C5_CTRL_TXN_DATA_TX) {
                esp32c5DataConfirmPendingTx(&device->dataPlane);
            } else if (device->ctrlPlane.txnKind == ESP32C5_CTRL_TXN_BLE_CFG_MTU) {
                LOG_I(ESP32C5_CTRL_LOG_TAG,
                      "mtu negotiate request accepted conn=%u current_mtu=%u configured=%u",
                      (unsigned int)device->state.connIndex,
                      (unsigned int)device->state.bleMtu,
                      (unsigned int)device->state.isBleMtuConfigured);
            } else if (device->ctrlPlane.txnKind == ESP32C5_CTRL_TXN_BLE_ADV_RESTART) {
                device->state.isBleAdvertising = true;
                LOG_I(ESP32C5_CTRL_LOG_TAG, "ble advertising restarted");
            } else if (device->ctrlPlane.txnKind == ESP32C5_CTRL_TXN_BLE_DISCONNECT) {
                device->state.isBleAdvertising = false;
                device->state.isBleConnected = false;
                device->state.connIndex = 0U;
                device->state.isBleMtuConfigured = false;
                device->state.bleMtu = 23U;
            }
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
            device->ctrlPlane.userTextLineHandler = NULL;
            device->ctrlPlane.userTextUserData = NULL;
            break;
        default:
            break;
    }

