StellanKenton/rep/module/esp32c5/esp32c5_ctrl.c
    return ESP32C5_STATUS_OK;
}

static eEsp32c5Status esp32c5ProcessCtrlStage(stEsp32c5Device *device, eEsp32c5MapType deviceId, uint32_t nowTickMs)
{
    const stEsp32c5ControlInterface *control;
    eEsp32c5Status status;
    const uint8_t *payloadBuf;
    uint16_t payloadLen;

    if (device == NULL) {
        return ESP32C5_STATUS_INVALID_PARAM;
    }

    switch (device->ctrlPlane.stage) {
        case ESP32C5_CTRL_STAGE_IDLE:
            return ESP32C5_STATUS_OK;
        case ESP32C5_CTRL_STAGE_ASSERT_RESET:
            if ((device->ctrlPlane.nextActionTick != 0U) && (nowTickMs < device->ctrlPlane.nextActionTick)) {
                return ESP32C5_STATUS_OK;
            }

            control = esp32c5GetControl(deviceId);
            if ((control == NULL) || (control->setResetLevel == NULL)) {
                esp32c5CtrlScheduleRetry(device, deviceId, nowTickMs, ESP32C5_STATUS_UNSUPPORTED);
                return ESP32C5_STATUS_UNSUPPORTED;
            }

            device->state.runState = ESP32C5_RUN_BOOTING;
            control->setResetLevel(device->cfg.resetPin, true);
            device->ctrlPlane.nextActionTick = nowTickMs + device->cfg.resetPulseMs;
            esp32c5CtrlSetStage(device, ESP32C5_CTRL_STAGE_RESET_HOLD);
            LOG_I(ESP32C5_CTRL_LOG_TAG,
                  "assert reset pin=%u pulse=%lu",
                  (unsigned int)device->cfg.resetPin,
                  (unsigned long)device->cfg.resetPulseMs);
            return ESP32C5_STATUS_OK;
        case ESP32C5_CTRL_STAGE_RESET_HOLD:
            if (nowTickMs < device->ctrlPlane.nextActionTick) {
                return ESP32C5_STATUS_OK;
            }

            control = esp32c5GetControl(deviceId);
            if ((control == NULL) || (control->setResetLevel == NULL)) {
                esp32c5CtrlScheduleRetry(device, deviceId, nowTickMs, ESP32C5_STATUS_UNSUPPORTED);
                return ESP32C5_STATUS_UNSUPPORTED;
            }

            control->setResetLevel(device->cfg.resetPin, false);
            device->state.isReadyUrcSeen = false;
            device->ctrlPlane.nextActionTick = nowTickMs + device->cfg.resetWaitMs + device->cfg.bootWaitMs;
            device->ctrlPlane.readyDeadlineTick = device->ctrlPlane.nextActionTick + device->cfg.readyTimeoutMs;
            esp32c5CtrlSetStage(device, ESP32C5_CTRL_STAGE_WAIT_READY);
            LOG_I(ESP32C5_CTRL_LOG_TAG,
                  "release reset waitReady timeout=%lu probe=%lu",
                  (unsigned long)device->cfg.readyTimeoutMs,
                  (unsigned long)device->cfg.readyProbeMs);
            return ESP32C5_STATUS_OK;
        case ESP32C5_CTRL_STAGE_WAIT_READY:
            if (nowTickMs < device->ctrlPlane.nextActionTick) {
                return ESP32C5_STATUS_OK;
            }

            if (device->state.isReadyUrcSeen) {
                device->state.runState = ESP32C5_RUN_CONFIGURING;
                esp32c5CtrlSetStage(device, ESP32C5_CTRL_STAGE_DISABLE_ECHO);
                LOG_I(ESP32C5_CTRL_LOG_TAG, "ready urc seen, continue init");
                return ESP32C5_STATUS_OK;
            }

            if (nowTickMs >= device->ctrlPlane.readyDeadlineTick) {
                esp32c5CtrlScheduleRetry(device, deviceId, nowTickMs, ESP32C5_STATUS_TIMEOUT);
                return ESP32C5_STATUS_TIMEOUT;
            }

            device->ctrlPlane.nextActionTick = nowTickMs + device->cfg.readyProbeMs;
            return ESP32C5_STATUS_OK;
        case ESP32C5_CTRL_STAGE_DISABLE_ECHO:
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_STAGE;
            return esp32c5SubmitCtrlText(device, "ATE0\r\n");
        case ESP32C5_CTRL_STAGE_BLE_INIT:
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_STAGE;
            return esp32c5BuildCtrlU16(device, "AT+BLEINIT=", device->bleCfg.initMode);
        case ESP32C5_CTRL_STAGE_BLE_SET_NAME:
            if (device->bleCfg.name[0] == '\0') {
                esp32c5CtrlSetStage(device, ESP32C5_CTRL_STAGE_BLE_SET_ADV_PARAM);
                return ESP32C5_STATUS_OK;
            }

            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_STAGE;
            return esp32c5BuildCtrlQuotedText(device, "AT+BLENAME=", device->bleCfg.name);
        case ESP32C5_CTRL_STAGE_BLE_SET_ADV_PARAM:
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_STAGE;
            return esp32c5BuildCtrlAdvParam(device);
        case ESP32C5_CTRL_STAGE_BLE_SET_ADV_DATA:
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_STAGE;
            return esp32c5BuildCtrlAdvData(device);
        case ESP32C5_CTRL_STAGE_BLE_ADV_START:
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_STAGE;
            return esp32c5SubmitCtrlText(device, "AT+BLEADVSTART\r\n");
        case ESP32C5_CTRL_STAGE_QUERY_MAC:
            device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_STAGE;
            return esp32c5SubmitCtrlText(device, "AT+BLEADDR?\r\n");
        case ESP32C5_CTRL_STAGE_RUNNING:
            device->state.runState = ESP32C5_RUN_READY;
            device->state.isReady = true;
            if (device->bleCfg.autoStartAdvertising && !device->state.isBleConnected && !device->state.isBleAdvertising) {
                device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_BLE_ADV_RESTART;
                return esp32c5SubmitCtrlText(device, "AT+BLEADVSTART\r\n");
            }

            if (device->state.isBleConnected && esp32c5DataHasPendingTx(&device->dataPlane)) {
                status = esp32c5DataBuildBleNotify(&device->dataPlane,
                                                   device->state.connIndex,
                                                   device->bleCfg.txServiceIndex,
                                                   device->bleCfg.txCharIndex,
                                                   esp32c5GetBleNotifyPayloadLimit(device),
                                                   device->ctrlPlane.cmdBuf,
                                                   (uint16_t)sizeof(device->ctrlPlane.cmdBuf),
                                                   &payloadBuf,
                                                   &payloadLen);
                if (status == ESP32C5_STATUS_NOT_READY) {
                    return ESP32C5_STATUS_OK;
                }
                if (status != ESP32C5_STATUS_OK) {
                    device->state.lastError = status;
                    return ESP32C5_STATUS_OK;
                }

