StellanKenton/rep/module/esp32c5/esp32c5_ctrl.c
                device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_DATA_TX;
                status = esp32c5SubmitCtrlPrompt(device, device->ctrlPlane.cmdBuf, payloadBuf, payloadLen);
                if (status != ESP32C5_STATUS_OK) {
                    device->ctrlPlane.txnKind = ESP32C5_CTRL_TXN_NONE;
                    device->state.lastError = status;
                }
            }
            return ESP32C5_STATUS_OK;
        default:
            return ESP32C5_STATUS_OK;
    }
}

static bool esp32c5MatchPrefix(const uint8_t *lineBuf, uint16_t lineLen, const char *prefix)
{
    uint16_t prefixLen;

    if ((lineBuf == NULL) || (prefix == NULL)) {
        return false;
    }

    prefixLen = (uint16_t)strlen(prefix);
    return (lineLen >= prefixLen) && (memcmp(lineBuf, prefix, prefixLen) == 0);
}

static const char *esp32c5CtrlGetStageName(eEsp32c5CtrlStage stage)
{
    switch (stage) {
        case ESP32C5_CTRL_STAGE_IDLE:
            return "idle";
        case ESP32C5_CTRL_STAGE_ASSERT_RESET:
            return "assert_reset";
        case ESP32C5_CTRL_STAGE_RESET_HOLD:
            return "reset_hold";
        case ESP32C5_CTRL_STAGE_WAIT_READY:
            return "wait_ready";
        case ESP32C5_CTRL_STAGE_DISABLE_ECHO:
            return "disable_echo";
        case ESP32C5_CTRL_STAGE_BLE_INIT:
            return "ble_init";
        case ESP32C5_CTRL_STAGE_BLE_SET_NAME:
            return "ble_set_name";
        case ESP32C5_CTRL_STAGE_BLE_SET_ADV_PARAM:
            return "ble_set_adv_param";
        case ESP32C5_CTRL_STAGE_BLE_SET_ADV_DATA:
            return "ble_set_adv_data";
        case ESP32C5_CTRL_STAGE_BLE_ADV_START:
            return "ble_adv_start";
        case ESP32C5_CTRL_STAGE_QUERY_MAC:
            return "query_mac";
        case ESP32C5_CTRL_STAGE_RUNNING:
            return "running";
        default:
            return "unknown";
    }
}

static const char *esp32c5CtrlGetRoleName(eEsp32c5Role role)
{
    switch (role) {
        case ESP32C5_ROLE_BLE_PERIPHERAL:
            return "ble_peripheral";
        case ESP32C5_ROLE_NONE:
        default:
            return "none";
    }
}

static void esp32c5CtrlSetStage(stEsp32c5Device *device, eEsp32c5CtrlStage stage)
{
    if (device == NULL) {
        return;
    }

    device->ctrlPlane.stage = stage;
}

/**************************End of file********************************/
